using System;

namespace Lab03
{
    class Program
    {
        public class Airline
        {
            public string Destination;
            public string FlightNumber;
            public string AircraftType;
            public string DepartureTime;
            public string DaysOfWeek;

            public void FlightInfoByDestination()
            {
                Console.WriteLine($"Студент {name} учится на   { course}  курсе в { UO}");
            }
            public void FlightInfoByDayOfWeek()
            {
                Console.WriteLine($"Студент {name} учится на   { course}  курсе в { UO}");
            }
        }

    
        static void Main(string[] args)
        { 
            //Создать класс Airline: Пункт назначения, Номер рейса, Тип самолета, Время вылета, Дни недели. 
            //Свойства иконструкторы должны обеспечивать проверку корректности.
            //Создать массив объектов.Вывести:
            //a) список рейсов для заданного пункта назначения;
            //b) список рейсов для заданного дня недели;

           
        }
       
    }
}
