using System;

namespace Lab03
{
    class Program
    {
        static void Main(string[] args)
        { 
            //Создать класс Airline: Пункт назначения, Номер рейса, Тип самолета, Время вылета, Дни недели. 
            //Свойства иконструкторы должны обеспечивать проверку корректности.
            //Создать массив объектов.Вывести:
            //a) список рейсов для заданного пункта назначения;
            //b) список рейсов для заданного дня недели;

           
        }
         public class Student
            {

            } 
    }
}
